================================================================================
exp
================================================================================
fn main {
  $exp:a
}
--------------------------------------------------------------------------------

(structure
  (function_definition
    (function_identifier
      (lowercase_identifier))
    (block_expression
      (quotation_expression_expander
        (quotation_variable)))))

================================================================================
pat
================================================================================
fn main {
  match $exp:a {
    $pat:p => $exp:b
  }
}
--------------------------------------------------------------------------------

(structure
  (function_definition
    (function_identifier
      (lowercase_identifier))
    (block_expression
      (match_expression
        (quotation_expression_expander
          (quotation_variable))
        (case_clause
          (pattern
            (simple_pattern
              (quotation_pattern_expander
                (quotation_variable))))
          (quotation_expression_expander
            (quotation_variable)))))))

================================================================================
ty
================================================================================
fn $id:name() -> $ty:retty {
}
--------------------------------------------------------------------------------

(structure
  (function_definition
    (function_identifier
      (lowercase_identifier
        (quotation_lowercase_identifier_expander
          (quotation_variable))))
    (parameters)
    (return_type
      (type
        (quotation_type_expander
          (quotation_variable))))
    (block_expression)))

================================================================================
ty
================================================================================
let $id:id : $ty:ty = $exp:exp
--------------------------------------------------------------------------------

(structure
  (value_definition
    (lowercase_identifier
      (quotation_lowercase_identifier_expander
        (quotation_variable)))
    (type_annotation
      (type
        (quotation_type_expander
          (quotation_variable))))
    (quotation_expression_expander
      (quotation_variable))))

================================================================================
Id
================================================================================
fn main {
  $Id:c($exp:a)
}
--------------------------------------------------------------------------------

(structure
  (function_definition
    (function_identifier
      (lowercase_identifier))
    (block_expression
      (apply_expression
        (constructor_expression
          (uppercase_identifier
            (quotation_uppercase_identifier_expander
              (quotation_variable))))
        (arguments
          (argument
            (quotation_expression_expander
              (quotation_variable))))))))

================================================================================
lit
================================================================================
fn main {
  let map = { $lit:key : $exp:value }
}
--------------------------------------------------------------------------------

(structure
  (function_definition
    (function_identifier
      (lowercase_identifier))
    (block_expression
      (let_expression
        (pattern
          (simple_pattern
            (lowercase_identifier)))
        (map_expression
          (map_element_expression
            (map_element_key
              (literal
                (quotation_literal_expander
                  (quotation_variable))))
            (quotation_expression_expander
              (quotation_variable))))))))

================================================================================
str
================================================================================
fn main {
  println($str:s)
}

extern $str:extern fn f(a : Int) = $str:ffi
--------------------------------------------------------------------------------

(structure
  (function_definition
    (function_identifier
      (lowercase_identifier))
    (block_expression
      (apply_expression
        (qualified_identifier
          (lowercase_identifier))
        (arguments
          (argument
            (atomic_expression
              (literal
                (string_literal
                  (quotation_string_expander
                    (quotation_variable))))))))))
  (function_definition
    (external_linkage
      (string_literal
        (quotation_string_expander
          (quotation_variable))))
    (function_identifier
      (lowercase_identifier))
    (parameters
      (parameter
        (positional_parameter
          (lowercase_identifier)
          (type_annotation
            (type
              (apply_type
                (qualified_type_identifier
                  (identifier
                    (uppercase_identifier)))))))))
    (external_source
      (string_literal
        (quotation_string_expander
          (quotation_variable))))))
